* Find the abstract expression of facets
  :PROPERTIES:
  :ID:       97837016-c518-490a-8c24-812e08fc562c
  :END:

From a database of facets of the form
#+BEGIN_LaTeX
  \begin{displaymath}
    \sum_i a_i x_i \ge a_0
  \end{displaymath}
#+END_LaTeX
each generated by a specific set of parameters $p_1, p_2, \ldots, p_m$
(for instance $(m,n,k,l)$ for the at_least predicate), we want to
express each $a_i$ as a function of the $p_i$.  We will try functions
of the form
#+BEGIN_LaTeX
  \begin{displaymath}
    c_0 + \sum_i c_i p_i + \sum_i \sum_j c_{i,j} p_i p_j + \ldots  = a
  \end{displaymath}
#+END_LaTeX
increasing the required dimension as needed.

Because the $p_i$ and the $a_i$ are data, this problem is linear in the $c$.  
Here is an example of the data, extracted manually from old instances of at-least.
The last parameter '-' is the number of elements that are negative; it really corresponds to the size of the set J (from our paper).  Somehow this needs to be identified as well.
#+BEGIN_EXAMPLE
(m n k l -)
(1 5 3 7 1) : (-4 3 72)
(1 5 3 8 1) : (-5 3 81)
(1 5 3 9 1) : (-2 1 30)
(1 5 4 7 1) : (-3 4 100)
(1 5 4 8 1) : (-1 1 28)
(1 5 4 9 1) : (-5 4 124)
#+END_EXAMPLE

#+BEGIN_SRC python :results output
  D=[[ 1,5,3,7,1], [1,5,3,8,1], [1,5,3,9,1], [1,5,4,7,1], [1,5,4,8,1], [1,5,4,9,1]]
  for (m,n,k,l,J) in D:
    print (k-l, k, m*k*k+(n-m-J)*k*l)
    
#+END_SRC

#+RESULTS:
: (-4, 3, 72)
: (-5, 3, 81)
: (-6, 3, 90)
: (-3, 4, 100)
: (-4, 4, 112)
: (-5, 4, 124)

